code-review/NRB_3471_3546/База_Стало/DataProcessors/ОбновлениеНезаполненныхКомментариевПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеНезаполненныхКомментариевПоручение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Депозитарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОПопечителе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МежДепозитарный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.МестаХранения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попечитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ОбновлениеНезаполненныхКомментариевПоручение/Forms/Форма/Ext/Form/Module.bsl
//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтаФорма);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала = Объект.ПериодНачало;
	Диалог.Период.ДатаОкончания = Объект.ПериодКонец;
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНажатие(Команда)
	
	ВыполнитьНажатиеНаСервере();
	
КонецПроцедуры


//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		Объект.ПериодНачало = Период.ДатаНачала;
		Объект.ПериодКонец = Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНажатиеНаСервере()
	
	Выборка	= Документы.Поручение.Выбрать(Объект.ПериодНачало, Объект.ПериодКонец);
	Пока Выборка.Следующий() Цикл
		// Проверка модифицированности дока
		МодифицированДок	= Ложь;
		//---
	    ОбъектДок	=	Выборка.ПолучитьОбъект();
		// Обновим комментарий если надо
		Если Не ЗначениеЗаполнено(ОбъектДок.Комментарий) И ((ОбъектДок.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеСчетаДепо) ИЛИ  (ОбъектДок.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо) ИЛИ (ОбъектДок.ВидОперацииД = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо)) Тогда
			ПараметрыДоговора	= ПолучитьПараметрыДоговораПоПоручению(ОбъектДок.Инициатор, ОбъектДок.Дата);
			Если ПараметрыДоговора.Количество()>0 Тогда
				Если (ОбъектДок.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеСчетаДепо) ИЛИ  (ОбъектДок.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо) Тогда
					ОбъектДок.Комментарий	= "Депозитарный договор №"+ПараметрыДоговора[0].Код+" от "+Формат(ПараметрыДоговора[0].ДатаНачалоДействия, "ДФ=dd.MM.yyyy");
					МодифицированДок		= Истина;
				ИначеЕсли (ОбъектДок.ВидОперацииД = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо) Тогда
					ОбъектДок.Комментарий	= "Договор обслуживания на финансовых рынках №"+ПараметрыДоговора[0].Код+" от "+Формат(ПараметрыДоговора[0].ДатаНачалоДействия, "ДФ=dd.MM.yyyy");
					МодифицированДок		= Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		//---
		Если МодифицированДок Тогда
			ОбъектДок.Записать(РежимЗаписиДокумента.Запись);
			#Если Клиент Тогда
				Сообщить("Модифицирован комментарий документа - "+ОбъектДок.Ссылка);
			#Иначе
				ЗаписьЖурналаРегистрации("Обновление комментариев 'Поручение'", УровеньЖурналаРегистрации.Информация, , , "Модифицирован комментарий документа - "+ОбъектДок.Ссылка);
			#КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДоговораПоПоручению(Инициатор, Дата)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Код,
	|	ДатаНачалоДействия,
	|	Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И (ДатаНачалоДействия <= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) ИЛИ ДатаНачалоДействия = ДАТАВРЕМЯ(1,1,1))
	|	И (ДатаОкончанияДействия >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) ИЛИ ДатаОкончанияДействия = ДАТАВРЕМЯ(1,1,1))
	|	И Владелец		= &Владелец
	|	И ТипДоговора	= ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.Депозитарный)");

	Запрос.УстановитьПараметр("Владелец", Инициатор);
	Запрос.УстановитьПараметр("Дата"	, Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

//#КонецОбласти
